# -*- coding: utf-8 -*-

import simple_draw as sd

sd.resolution = (1200, 800)
point_0 = sd.get_point(600, 5)


def branch(point, angle, length):
    if length < 3:
        return
    v1 = sd.get_vector(start_point=point, angle=angle, length=length, width=1)
    v1.draw()
    next_point = v1.end_point
    delta = 30
    delta = delta + delta * (40 - sd.random_number(b=80)) / 100
    delta_lenght = .75
    delta_lenght = delta_lenght + delta_lenght * (20 - sd.random_number(b=40)) / 100
    next_angle1 = angle - delta
    next_angle2 = angle + delta
    next_length = length * delta_lenght
    branch(point=next_point, angle=next_angle1, length=next_length)
    branch(point=next_point, angle=next_angle2, length=next_length)


# for delta in range(0, 51, 10):
branch(point=point_0, angle=90, length=150)

print(sd.random_number())

# 1) Написать функцию draw_branches, которая должна рисовать две ветви дерева из начальной точки
# Функция должна принимать параметры:
# - точка начала рисования,
# - угол рисования,
# - длина ветвей,
# Отклонение ветвей от угла рисования принять 30 градусов,

# 2) Сделать draw_branches рекурсивной
# - добавить проверку на длину ветвей, если длина меньше 10 - не рисовать
# - вызывать саму себя 2 раза из точек-концов нарисованных ветвей,
#   с параметром "угол рисования" равным углу только что нарисованной ветви,
#   и параметром "длинна ветвей" в 0.75 меньшей чем длина только что нарисованной ветви

# 3) первоначальный вызов:
# root_point = get_point(300, 30)
# draw_bunches(start_point=root_point, angle=90, length=100)

# Пригодятся функции
# sd.get_point()
# sd.get_vector()
# Возможный результат решения см lesson_004/results/exercise_04_fractal_01.jpg

# можно поиграть -шрифтами- цветами и углами отклонения


# 4) Усложненное задание (делать по желанию)
# - сделать рандомное отклонение угла ветвей в пределах 40% от 30-ти градусов
# - сделать рандомное отклонение длины ветвей в пределах 20% от коэффициента 0.75
# Возможный результат решения см lesson_004/results/exercise_04_fractal_02.jpg

# Пригодятся функции
# sd.random_number()

sd.pause()
